{
  "/": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Welcome to MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours",
    "Book Tickets",
    "Explore Exhibits",
    "Experience the Museum Like Never Before",
    "Watch this immersive preview of our exhibits and virtual tour experience.",
    "Why Choose MuseumHub?",
    "Discover the future of museum experiences with royal elegance",
    "3D Virtual Tours",
    "Explore exhibits in stunning 3D with interactive virtual reality experiences that bring history to life with unprecedented detail and immersion.",
    "10K+ Visitors",
    "4.9/5 Rating",
    "AI Assistant",
    "Get personalized guidance from our intelligent chatbot that knows every exhibit and can answer any question with scholarly precision.",
    "24/7 Support",
    "Smart Learning",
    "Multilingual Support",
    "Experience exhibits in your preferred language with our advanced translation and localization features for a truly global experience.",
    "10+ Languages",
    "Global Access",
    "Quick Actions",
    "Begin your extraordinary museum journey",
    "Book Tickets",
    "Reserve your spot for upcoming exhibits and special events. Secure your place in history with our premium booking system.",
    "Book Now",
    "My Tickets",
    "View and manage your booked tickets with ease. Access your digital tickets and receive important updates.",
    "View Tickets",
    "Ask the AI",
    "Chat with our sophisticated AI assistant for instant help, detailed information, and personalized recommendations.",
    "Chat Now",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Terms & Conditions",
    "Security Policy",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/about": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "About MuseumHub",
    "MuseumHub is dedicated to revolutionizing the museum experience with immersive 3D exhibits, multilingual support, and AI-powered assistance. Our mission is to make art and history accessible, engaging, and interactive for everyone.",
    "Our Team",
    "We are a passionate group of technologists, historians, and artists working together to bring the best of culture and technology to the world.",
    "Our Vision",
    "To create a global platform where anyone can explore, learn, and connect with the wonders of museums from anywhere in the world.",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/services": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Our Premium Services",
    "Discover world-class museum experiences tailored for the digital age",
    "3D Virtual Tours",
    "Step into the museum from anywhere in the world with our interactive 3D virtual tours. Experience exhibits with unprecedented detail and immersion.",
    "360° Views",
    "Global Access",
    "AI Chatbot Guide",
    "Get instant answers and personalized recommendations from our sophisticated AI assistant trained on museum knowledge.",
    "24/7 Available",
    "Smart Learning",
    "Multilingual Support",
    "Enjoy the museum experience in your preferred language with seamless translation and localized content.",
    "10+ Languages",
    "Voice Support",
    "Online Ticket Booking",
    "Book your tickets online with ease and manage your reservations anytime through our secure platform.",
    "Mobile Tickets",
    "Secure Payment",
    "Event Scheduling",
    "Stay updated with upcoming events, workshops, and special exhibitions with personalized notifications.",
    "Smart Alerts",
    "VIP Events",
    "Happy Visitors",
    "Exhibits",
    "Languages",
    "AI Support",
    "Ready to Experience MuseumHub?",
    "Join thousands of visitors who have discovered the future of museum exploration",
    "Book Your Visit",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/book_ticket": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Book Museum Tickets",
    "Select Tickets",
    "Visitor Details",
    "Payment",
    "Select Visit Date",
    "November 2025",
    "",
    "",
    "Selected Visit Date",
    "26 November 2025",
    "Group tickets and special exhibitions must be booked at the Museum Reception on the day of visit.",
    "Select Tickets",
    "Adult",
    "General admission (18 years and above)",
    "₹150/ Person",
    "Child",
    "Children (5 - 17 years)",
    "₹80/ Person",
    "Senior Citizen",
    "Senior Citizens (60 years and above)",
    "₹100/ Person",
    "Student",
    "Students with valid ID (12-25 years)",
    "₹60/ Person",
    "Infant",
    "Children below 5 years",
    "Free",
    "Add-On Services",
    "Audio Guide",
    "₹50/ Device",
    "VR Experience",
    "₹100/ Person",
    "Photography Pass",
    "₹200/ Group",
    "Guided Tour",
    "₹300/ Group",
    "Continue to Visitor Details",
    "Visitor Information",
    "Contact Information",
    "Primary Contact Phone Number *",
    "Email Address (Optional)",
    "Back to Tickets",
    "Proceed to Payment",
    "Booking Summary",
    "Tickets Subtotal:",
    "Add-ons:",
    "Taxes & Fees (18%):",
    "Total Amount:",
    "Back to Details",
    "Complete Payment",
    "Payment Successful!",
    "Your museum tickets have been successfully booked. \n                    Here's your digital ticket:",
    "MuseumHub",
    "Digital Entry Ticket",
    "Booking ID",
    "Visit Date",
    "Total Amount",
    "Contact",
    "Visitors",
    "Add-ons",
    "None",
    "Please show this ticket at the museum entrance.\n                        Arrive 15 minutes before your visit time.\n                        Museum Hours: 9:00 AM - 6:00 PM\n                        Contact: +91 98765 43210",
    "Download Ticket",
    "Print Ticket",
    "Send to Email",
    "Tickets Subtotal:",
    "Add-ons:",
    "Taxes & Fees:",
    "Total Amount:",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/login": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Welcome Back",
    "Sign in to your MuseumHub account",
    "Username",
    "Password",
    "Remember me",
    "Forgot Password?",
    "Sign In",
    "Or continue with",
    "Google",
    "Facebook",
    "Don't have an account? Sign up",
    "Sign up",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/register": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Join MuseumHub",
    "Create your account to start exploring amazing museums",
    "Please enter a valid username",
    "Please enter a valid email address",
    "Password strength: Enter password",
    "Enter password",
    "Password must be at least 8 characters",
    "Passwords do not match",
    "I agree to the",
    "Terms & Conditions",
    "and",
    "Privacy Policy",
    "Create My Account",
    "Or sign up with",
    "Google",
    "Facebook",
    "Already have an account?",
    "Sign in here",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/view": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Explore 3D Exhibits",
    "Immerse yourself in history with our interactive 3D collection",
    "All",
    "Ancient",
    "Wildlife",
    "Technology",
    "Mythology",
    "Dinosaur Sculpture",
    "Marvel at the intricate details of this prehistoric masterpiece, showcasing the magnificent creatures that once roamed our planet millions of years ago.",
    "Prehistoric",
    "Wildlife",
    "3D Model",
    "Learn More",
    "Phoenix Bird",
    "Discover the mythical phoenix in stunning 3D detail, representing rebirth and renewal in ancient mythologies across cultures.",
    "Mythology",
    "Legendary",
    "Phoenix",
    "Learn More",
    "Wooden Bicycle",
    "Explore this unique wooden bicycle from our collection, showcasing early transportation innovation and craftsmanship.",
    "Transportation",
    "Vintage",
    "Wooden",
    "Learn More",
    "Dodo Bird (Extinct)",
    "Experience the extinct dodo bird in 3D, a poignant reminder of species we've lost and the importance of conservation.",
    "Extinct",
    "Rare",
    "Conservation",
    "Learn More",
    "Black & White TV",
    "Step back in time with this vintage black and white television, representing the dawn of broadcast entertainment technology.",
    "Vintage",
    "Technology",
    "Retro",
    "Learn More",
    "3D Exhibits",
    "Monthly Visitors",
    "Categories",
    "Access",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Terms & Conditions",
    "Security Policy",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/chatbot": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "🏛️ MuseumHub Assistant",
    "Your friendly museum booking guide",
    "Not Logged In",
    "",
    "Send",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/terms": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Terms & Conditions",
    "These Terms & Conditions (“Terms”) govern your use of the MuseumHub website, online services, and physical visit experience.\n            By accessing or using MuseumHub, booking tickets, or visiting our premises, you agree to be bound by these Terms.",
    "Last updated: 2024",
    "1. Acceptance of Terms",
    "By using MuseumHub’s website, mobile experience, AI chatbot, or any other digital or on-site services, you acknowledge that you have read,\n            understood, and agree to be bound by these Terms & Conditions, as well as our Privacy and Security policies.\n            If you do not agree to these Terms, you should not use our services or visit our premises.",
    "2. Eligibility",
    "To make bookings or create an account on MuseumHub, you must:",
    "Be at least 18 years of age, or have the consent and supervision of a legal guardian.",
    "Provide accurate, complete, and up-to-date information during registration and booking.",
    "Comply with all applicable local laws and regulations when using our services or visiting the museum.",
    "3. Account Registration & Security",
    "You may be required to create an account to access certain features such as ticket booking, history, and personalized services.\n            You are responsible for maintaining the confidentiality of your login credentials and for all activities that occur under your account.",
    "You agree to notify MuseumHub immediately of any unauthorized use of your account or any other breach of security.\n            MuseumHub is not liable for any loss or damage arising from your failure to secure your account.",
    "4. Ticket Booking & Use",
    "MuseumHub provides an online booking system for purchasing tickets to visit the museum and experience exhibits, events, or special programs.\n            By completing a booking, you confirm that all details provided (date, time, number of visitors, ticket type, etc.) are accurate.",
    "Tickets are valid only for the date, time slot, and purpose specified at the time of booking.",
    "Entry may be denied if you fail to present a valid ticket and a corresponding identity proof if required.",
    "Tickets are non-transferable unless explicitly allowed by MuseumHub for specific events or passes.",
    "5. Pricing & Payments",
    "All prices for tickets, add-on services, and experiences are displayed on our platform and are subject to change at any time without prior notice.",
    "Payments must be made in full at the time of booking using the available payment methods.",
    "Any applicable taxes, service charges, or government levies will be added to the ticket price as required by law.",
    "MuseumHub uses third-party payment gateways. We do not store your complete payment card details.",
    "6. Cancellation, Rescheduling & No-Refund Policy",
    "IMPORTANT: ALL CONFIRMED BOOKINGS ARE STRICTLY NON-REFUNDABLE.",
    "Once a ticket has been successfully booked and payment is completed, no refunds will be issued under any circumstances,\n                including but not limited to change of mind, personal emergencies, travel issues, late arrival, or failure to attend.",
    "In limited cases, MuseumHub may, at its sole discretion, allow rescheduling of visits subject to availability and internal policy.\n            Such rescheduling may incur additional charges. Approval of rescheduling requests is not guaranteed.",
    "If MuseumHub is required by law or government order to cancel or curtail operations (for example, due to safety, security, or health regulations),\n            we may provide alternative dates, credits, or other remedies as permitted by applicable law. Cash refunds are generally not provided unless explicitly required by law.",
    "7. Museum Entry, Visitor Conduct & Damage to Property",
    "All visitors are required to follow museum rules, staff instructions, and signage displayed within the premises.\n            MuseumHub reserves the right to deny entry or request any visitor to leave the premises in case of inappropriate behavior, safety concerns, or violation of rules,\n            without any refund or compensation.",
    "Visitors must not touch, damage, deface, or interfere with any exhibits, installations, artifacts, or equipment.",
    "Bringing hazardous items, weapons, illegal substances, or prohibited materials into the museum is strictly forbidden.",
    "Visitors are responsible for supervising their children, dependents, or group members at all times.",
    "DAMAGE TO PROPERTY & FINES",
    "Any damage, destruction, or loss caused—whether willful, negligent, or accidental—to MuseumHub property, exhibits, digital equipment,\n                infrastructure, or third-party installations will result in financial liability on the responsible visitor(s).",
    "MuseumHub reserves the right to:",
    "Impose appropriate fines and recovery charges to cover repair, restoration, or replacement costs.",
    "Seek compensation through legal proceedings under applicable civil and criminal laws.",
    "Share relevant details with law enforcement authorities where required.",
    "8. Digital Services, Virtual Tours & AI Assistant",
    "MuseumHub may offer digital services such as virtual tours, 3D exhibits, AI-powered chat assistance, and multilingual content.\n            These services are provided for informational and experiential purposes only and may not always be fully accurate, complete, or up to date.",
    "You agree not to misuse, reverse-engineer, probe, or attempt to disrupt our digital platforms, translation systems, or AI services.\n            MuseumHub is not liable for interruptions, delays, or inaccuracies arising from technical issues, network problems, or third-party providers.",
    "9. Intellectual Property",
    "All content on MuseumHub, including but not limited to logos, trademarks, text, graphics, images, audio-visual content, 3D models, software,\n            and design elements, is owned by or licensed to MuseumHub and is protected by intellectual property laws.",
    "You are not permitted to copy, reproduce, distribute, modify, publish, or create derivative works from any content without prior written permission.\n            Limited personal, non-commercial viewing and use is allowed as part of your normal visit or interaction with our services.",
    "10. Privacy & Security",
    "MuseumHub values your privacy and data security. Information collected during account creation, booking, or visiting our premises\n            is handled in accordance with our Privacy Policy and Security Policy.",
    "While we implement reasonable security measures, no system is completely secure. By using our services, you accept the inherent risks\n            associated with online transactions and data transmission.",
    "11. Third-Party Services & Links",
    "MuseumHub may integrate or provide links to third-party websites, payment gateways, content providers, or social media platforms.\n            We do not control and are not responsible for the content, policies, or practices of these third parties.\n            Your use of third-party services is at your own risk and subject to their respective terms and privacy policies.",
    "12. Disclaimers",
    "MuseumHub strives to provide accurate information, high-quality exhibits, and a safe environment. However, all services are provided on an “as is”\n            and “as available” basis, without warranties of any kind, either express or implied.",
    "We do not guarantee uninterrupted access, error-free content, or that defects will be corrected immediately.\n            To the fullest extent permitted by law, MuseumHub disclaims all warranties, including but not limited to implied warranties of merchantability,\n            fitness for a particular purpose, and non-infringement.",
    "13. Limitation of Liability",
    "To the maximum extent permitted by law, MuseumHub, its directors, employees, partners, and affiliates shall not be liable for any indirect,\n            incidental, special, consequential, or punitive damages arising out of or in connection with your use of our services or visit to our premises.",
    "Our total aggregate liability for any claim, whether in contract, tort, or otherwise, shall not exceed the total amount paid by you to MuseumHub\n            for the relevant booking or service giving rise to the claim.",
    "14. Indemnity",
    "You agree to indemnify, defend, and hold harmless MuseumHub and its staff, partners, and affiliates from and against any claims, liabilities,\n            damages, losses, and expenses, including reasonable legal fees, arising out of or related to:",
    "Your use or misuse of our website, services, or premises.",
    "Your violation of these Terms or any applicable law.",
    "Any damage or loss caused by you or members of your group to MuseumHub property or third-party property.",
    "15. Changes to These Terms",
    "MuseumHub reserves the right to update, modify, or replace these Terms at any time.\n            Changes will be effective upon posting on our website or notifying users by reasonable means.\n            Your continued use of our services or visit to the museum after such changes constitutes your acceptance of the updated Terms.",
    "16. Governing Law & Jurisdiction",
    "These Terms & Conditions shall be governed by and construed in accordance with the laws of India,\n            without regard to its conflict of law principles.",
    "You agree that the courts located in your museum’s jurisdiction (e.g., Bengaluru, Karnataka) shall have exclusive jurisdiction\n            over any dispute arising out of or in connection with these Terms or your use of MuseumHub’s services.",
    "17. Contact Information",
    "If you have any questions or concerns about these Terms & Conditions, you may contact us at:",
    "123 Culture Street, Art District",
    "Note: These Terms are provided as a general framework and do not constitute legal advice.\n            For full legal compliance, you may wish to have them reviewed by a qualified legal professional.",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Terms & Conditions",
    "Security Policy",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ],
  "/security": [
    "Translating content...",
    "Home",
    "About",
    "Services",
    "Login",
    "Register",
    "Security Policy",
    "At MuseumHub, we take the security and privacy of our visitors, users, and systems very seriously.\n            This Security Policy describes the technical, organizational, and physical measures we use to protect your data,\n            secure our website and applications, and maintain a safe environment inside the museum premises.",
    "Last updated: 2024",
    "1. Scope of This Policy",
    "This Security Policy applies to all MuseumHub digital platforms (including our website, ticket booking system,\n            AI chatbot, language translation system, virtual tours, and generated PDF tickets) as well as security practices\n            followed within the physical museum location. It covers data protection, access control, infrastructure security,\n            payments, email communication, and visitor safety measures.",
    "2. Technology Stack & Application Architecture",
    "MuseumHub is built using a modern web technology stack designed with security and reliability in mind:",
    "Backend: Flask (Python) as the main backend framework for routing, authentication,\n                and business logic.",
    "Database Layer: Flask-SQLAlchemy with SQLite for structured, ORM-based database access,\n                reducing the risk of SQL injection through parameterized queries.",
    "Templating: Jinja2 templates for rendering HTML views with automatic escaping of dynamic data to reduce XSS risks.",
    "Frontend: HTML, CSS, and JavaScript for the user interface, chatbot interactions, and smooth UX.",
    "Localization: Flask-Babel for multilingual support, ensuring translated content is managed safely on the server side.",
    "CORS Control: Flask-CORS is used to control cross-origin requests in a safe and configurable way.",
    "Email System: Flask-Mail for sending verification, notifications, and ticket emails securely.",
    "PDF Tickets & Documents: ReportLab (SimpleDocTemplate, Paragraph, Table, etc.) for generating ticket PDFs\n                and documents server-side, without exposing internal templates to the client.",
    "Payments: Razorpay integration for secure online payments using industry-standard payment security.",
    "Hashing & Utilities: Python’s hashlib for cryptographic hashing, and safe usage of threading,\n                JSON handling, and file operations.",
    "We follow best practices in Flask application development, including separation of concerns, configuration via environment variables,\n            and minimal exposure of sensitive internal details.",
    "3. Authentication & Password Security",
    "SECURE CRYPTOGRAPHIC HASHING FOR LOGIN",
    "MuseumHub does not store plain-text passwords. All user passwords are protected using cryptographic hashing\n                (via Python’s hashlib and secure hashing algorithms). This means that even if someone accessed the database,\n                they would not see the original passwords in readable form.",
    "When a user registers or logs in, their password is processed using a secure hashing function before storing or checking it against\n            the database. We do not log raw passwords anywhere in the system.",
    "Passwords are never stored or transmitted in plain text.",
    "Only hashed values are stored in the SQLAlchemy/SQLite database.",
    "Login attempts can be monitored for suspicious behavior, such as brute-force attacks.",
    "Sessions are managed securely using Flask’s built-in session management.",
    "4. Data Protection & Secure Transmission",
    "Personal data such as names, contact details, ticket information, and booking history are treated as sensitive\n            and are protected against unauthorized access, modification, or disclosure.",
    "MuseumHub is intended to be deployed using HTTPS (TLS/SSL) so that all data transmitted between the user’s browser\n                and the server is encrypted in transit.",
    "Form inputs and API requests are validated and sanitized to reduce the risk of injection attacks and malformed data.",
    "Access to sensitive data in the SQLite database is restricted at the application level to authorized operations only.",
    "Generated PDFs (tickets, receipts) only contain necessary information and are created on the server using ReportLab,\n                reducing the exposure of internal structures or logic.",
    "5. CORS, Frontend & API Security",
    "MuseumHub uses JavaScript for interactive features including the chatbot, language switching, and dynamic updates.\n            Flask-CORS is used in a controlled manner to manage which origins are allowed to access backend APIs.",
    "Only approved origins are allowed to make cross-origin requests (as configured in CORS settings).",
    "Data displayed in HTML templates is automatically escaped by Jinja2 to help prevent cross-site scripting (XSS).",
    "JSON responses are structured and sanitized before being sent to the frontend.",
    "Client-side JavaScript (including chatbot UI and translation scripts) does not store raw passwords or payment information.",
    "6. Email & Communication Security",
    "MuseumHub uses Flask-Mail to send emails such as booking confirmations, ticket PDFs, and important notifications.",
    "Emails are sent through configured SMTP servers that can support TLS encryption for secure email transmission.",
    "We avoid including sensitive data (such as full payment credentials or passwords) in email content.",
    "PDF tickets generated using ReportLab may be attached to emails, containing only booking and visit details.",
    "7. Payments & Financial Security (Razorpay)",
    "MuseumHub integrates Razorpay as a secure payment gateway for online ticket purchases and add-on services.\n            Razorpay provides PCI-DSS compliant payment processing and handles sensitive card or UPI details on its own infrastructure.",
    "Payment details (card numbers, CVV, UPI PIN, etc.) are not stored on the MuseumHub server or in the SQLite database.",
    "Payment requests are initiated via Razorpay’s secure APIs, and the backend verifies payment status using Razorpay credentials and signatures.",
    "Users are encouraged to verify Razorpay pages and never share OTPs or sensitive details with anyone claiming to be from MuseumHub.",
    "8. Logging, Monitoring & Thread Safety",
    "MuseumHub may use logging and basic monitoring to understand system health, performance, and suspicious activity.\n            Threading and locking mechanisms are used carefully to ensure safe access to shared resources where applicable.",
    "Important events (errors, failed logins, payment callbacks) may be logged for analysis and debugging.",
    "Sensitive data such as passwords and full payment details are not written to logs.",
    "Where multi-threading is used (via Python threading.Lock and similar), critical sections are protected to avoid race conditions and inconsistent state.",
    "9. Physical Security Inside the Museum",
    "Security is not limited to the website; we also apply strong physical security controls within the museum premises to protect visitors,\n            staff, exhibits, and infrastructure.",
    "Access Control: Only visitors with valid tickets (digital or printed) are allowed entry during operating hours.",
    "Surveillance: Key areas of the museum may be monitored with CCTV as per local laws and regulations.",
    "Exhibit Protection: Sensitive or high-value exhibits may be secured behind glass, barriers, or restricted zones.",
    "Emergency Measures: Fire exits, alarms, and evacuation plans are in place to ensure safety during emergencies.",
    "Prohibited Items: Weapons, hazardous materials, and illegal substances are strictly forbidden on museum property.",
    "Visitors must follow staff instructions, safety signage, and museum rules at all times to maintain a secure environment.",
    "10. Protection of Exhibits, Devices & Digital Installations",
    "MuseumHub uses various digital experiences such as screens, VR setups, and interactive kiosks alongside traditional exhibits.",
    "Unauthorized tampering with exhibits, projectors, computers, VR headsets, networking hardware, or sensors is strictly prohibited.",
    "Any intentional or negligent damage to museum property may result in fines, recovery of repair/replacement costs, and legal action.",
    "Critical servers and networking equipment are kept in access-restricted areas.",
    "11. User & Visitor Responsibilities",
    "Security is a shared responsibility. To help protect your account, data, and the MuseumHub ecosystem, users and visitors are expected to:",
    "Use strong, unique passwords and keep them confidential.",
    "Log out from shared or public devices after using the MuseumHub website.",
    "Avoid sharing OTPs, passwords, or financial information with unverified sources.",
    "Respect museum property and report any suspicious activity or incidents to staff.",
    "12. Changes & Continuous Improvement",
    "Threats, technologies, and best practices evolve over time. MuseumHub is committed to continuously improving its security posture by:",
    "Reviewing and updating backend code, dependencies, and server configurations.",
    "Enhancing access control, monitoring, and alerting mechanisms where applicable.",
    "Refining physical security and visitor guidelines based on experience and feedback.",
    "We may update this Security Policy periodically. Any changes will be effective when posted on the MuseumHub website.",
    "13. Contact for Security Questions",
    "If you have questions about this Security Policy, or if you believe you have identified a security issue related to MuseumHub,\n            you can contact us at:",
    "123 Culture Street, Art District",
    "Note: This Security Policy describes general security practices and intentions for MuseumHub and does not constitute legal or compliance certification.",
    "MuseumHub",
    "Experience art and history like never before with our immersive 3D exhibits and AI-powered guided tours.",
    "Quick Links",
    "Home",
    "About",
    "Services",
    "Book Tickets",
    "Terms & Conditions",
    "Security Policy",
    "Contact Info",
    "123 Culture Street, Art District",
    "Follow Us",
    "© 2024 MuseumHub. All rights reserved."
  ]
}